Rewbert/stm32-nucleo/firmware/drivers/src/drivers/stm32l5/gpio.c

#include "domain/domain.h"
#include "domain/cmsis_select.h"

#include "backends/stm32l5/gpio.h"

#include "stm32l5xx.h"

static inline uint32_t pin_shift(uint8_t pin) {
    return pin * 2U;
}

/* Helpers */

static inline void stm32l5_gpio_set_mode(stm32l5_gpio_backend_t *backend, gpio_mode_t mode) {
    backend->gpio->MODER &= ~(0x3U << pin_shift(backend->pin));
    backend->gpio->MODER |= (((uint32_t) mode) << pin_shift(backend->pin));
}

static inline void stm32l5_gpio_set_pupdr(stm32l5_gpio_backend_t *backend, gpio_pull_t pull) {
    backend->gpio->PUPDR &= ~(0x3U << pin_shift(backend->pin));
    backend->gpio->PUPDR |= (((uint32_t) pull) << pin_shift(backend->pin));
}

static inline void stm32l5_gpio_set_af(stm32l5_gpio_backend_t *backend, gpio_mode_t mode, gpio_af_t af) {
    if(mode == GPIO_MODE_AF) {
        if(backend->pin >= 0 && backend->pin < 8) {
            backend->gpio->AFR[0] &= ~(0xFU << (backend->pin * 4));
            backend->gpio->AFR[0] |= (af << (backend->pin * 4));
        } else if(backend->pin >= 8 && backend->pin < 16) {
            backend->gpio->AFR[1] &= ~(0xFU << ((backend->pin - 8) * 4));
            backend->gpio->AFR[1] |= (af << ((backend->pin - 8) * 4));
        }
    }
}

static inline void stm32l5_gpio_set_seccfgr(stm32l5_gpio_backend_t *backend, gpio_security_t security_domain) {
#if HAL_SECURE
    switch(security_domain) {
        case GPIO_SECURE: backend->gpio->SECCFGR |= (1U << backend->pin); return;
        case GPIO_NONSECURE: backend->gpio->SECCFGR &= ~(1U << backend->pin); return;
        default: return;
    }
#endif
}

/* Driver API functions */

static void stm32l5_gpio_init(struct gpio_dev *dev, gpio_config_t *config) {
    // disable interrupts here
#if HAL_SECURE
    stm32l5_gpio_backend_t *backend = (stm32l5_gpio_backend_t*) dev->backend;

    stm32l5_gpio_set_af(backend, config->mode, config->alternate);
    stm32l5_gpio_set_mode(backend, config->mode);
    stm32l5_gpio_set_pupdr(backend, config->pull);
#endif
    // enable interrupts here
}

static void stm32l5_gpio_set_security(struct gpio_dev *dev, gpio_security_t security) {
#if HAL_SECURE
    stm32l5_gpio_backend_t *backend = (stm32l5_gpio_backend_t*) dev->backend;

    stm32l5_gpio_set_seccfgr(backend, security);
#endif
}

static void stm32l5_gpio_write(struct gpio_dev *dev, gpio_level_t level) {
    stm32l5_gpio_backend_t *backend = (stm32l5_gpio_backend_t*) dev->backend;
    uint32_t mask = 0x1U << backend->pin;

    if(level == GPIO_LOW) {
        backend->gpio->BSRR = mask << 16;
    } else {
        backend->gpio->BSRR = mask;
    }
}

static gpio_level_t stm32l5_gpio_read(struct gpio_dev *dev) {
    stm32l5_gpio_backend_t *backend = (stm32l5_gpio_backend_t*) dev->backend;

    uint32_t val = backend->gpio->IDR & (0x1U << backend->pin);
    return val ? GPIO_HIGH : GPIO_LOW;
}

static void stm32l5_gpio_toggle(struct gpio_dev *dev) {
    stm32l5_gpio_backend_t *backend = (stm32l5_gpio_backend_t*) dev->backend;

    /**
     * @brief ODR represents the latest output _we_ wrote to the pin, but not necessarily the true value. For that, we
     * should look at IDR (the real-time voltage reading). However, I do not believe that I will have different
     * peripherals/pieces of code fighting for the same pin, so modifying ODR should probably be OK enough. I believe
     * that ODR will accurately reflect what state the actual pin has.
     */
    backend->gpio->ODR ^= (0x1U << backend->pin);
}

static uint8_t stm32l5_gpio_pin(struct gpio_dev *dev) {
    stm32l5_gpio_backend_t *backend = (stm32l5_gpio_backend_t*) dev->backend;
    return backend->pin;
}

/* Wrapping up */

static const gpio_driver_api_t stm32l5_gpio_api = {
    .init         = stm32l5_gpio_init,
    .set_security = stm32l5_gpio_set_security,
    .write        = stm32l5_gpio_write,
    .read         = stm32l5_gpio_read,
    .toggle       = stm32l5_gpio_toggle,
    .pin          = stm32l5_gpio_pin,
};

void stm32l5_gpio_create(gpio_dev_t *dev,
                      GPIO_TypeDef *port,
                      uint8_t pin,
                      stm32l5_gpio_backend_t *backend_storage) {
    backend_storage->gpio = port;
    backend_storage->pin  = pin;

    dev->api = &stm32l5_gpio_api;
    dev->backend = backend_storage;
}

/* Port-level (batched) operations */

static void stm32l5_gpio_port_write(struct gpio_port_dev *dev, struct gpio_dev **devs, gpio_level_t *levels, size_t n) {
    stm32l5_gpio_port_backend_t *backend = (stm32l5_gpio_port_backend_t*) dev->backend;
    uint32_t set_mask = 0, reset_mask = 0;

    for (size_t i = 0; i < n; i++) {
        uint32_t bit = 0x1U << gpio_pin(devs[i]);
        if (levels[i] == GPIO_HIGH) {
            set_mask |= bit;
        } else {
            reset_mask |= bit;
        }
    }

    backend->gpio->BSRR = set_mask | (reset_mask << 16);
}

static void stm32l5_gpio_port_read(struct gpio_port_dev *dev, struct gpio_dev **devs, gpio_level_t *out, size_t n) {
    stm32l5_gpio_port_backend_t *backend = (stm32l5_gpio_port_backend_t*) dev->backend;
    uint32_t idr = backend->gpio->IDR;

    for (size_t i = 0; i < n; i++) {
        out[i] = (idr & (0x1U << gpio_pin(devs[i]))) ? GPIO_HIGH : GPIO_LOW;
    }
}

static const gpio_port_driver_api_t stm32l5_gpio_port_api = {
    .write = stm32l5_gpio_port_write,
    .read  = stm32l5_gpio_port_read,
};

void stm32l5_gpio_port_create(gpio_port_dev_t *dev,
                              GPIO_TypeDef *port,
                              stm32l5_gpio_port_backend_t *backend_storage) {
    backend_storage->gpio = port;

    dev->api     = &stm32l5_gpio_port_api;
    dev->backend = backend_storage;
}
